run/laserMixedWeldSmall/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (argon steel copper);

// surface tension between argon and steel
sigma12
{
  sigma
  {
    type  temperatureDependent;
    sigma 
    {
        // const 1.7 until Tliq 1710, then reduces linearly with -2.5e-4
        type    table;
        values
        (
            (1710 0.7)
            (8510 0.0)
        );
        outOfBounds         clamp;
        interpolationScheme linear;
    }
  }
}

// surface tension between argon and copper
sigma13
{
  sigma
  {
    type  temperatureDependent;
    sigma 
    {
        // const 1.3 until Tliq 1357, then reduces linearly with -2.85e-4
        type    table;
        values
        (
            (1357 0.3)
            (5918 0.0)
        );
        outOfBounds         clamp;
        interpolationScheme linear;
    }
  }
}

// Diffusivity between steel and copper
D23 3e-09;

// ************************************************************************* //
