run/laserMixedWeldSmall/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             initPowderBed;

coordinateSystem global;

globalCoeffs
{
    e1              (1 0 0);
    e2              (0 1 0);
}

directions
(
    e1
    e2
    e3
);

useHexTopology  yes;

geometricCut    no;

writeMesh       no;

// ************************************************************************* //
